Reports/ВаловаяПрибыльРозница.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ВаловаяПрибыльРозница</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВЕдиницахДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВыработкаИсполнителейРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаИсполнителейРозницы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументУСВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаСтоимостиВыработкиПоНоменклатуре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектВыработки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/МонтажСебестоимостьМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>МонтажСебестоимостьМатериалов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/МонтажСебестоимостьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>МонтажСебестоимостьТоваров</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ВаловаяПрибыльРозница/Ext/ObjectModule.bsl
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
//	//Если Константы.МонтажКакРеализация.Получить() Тогда
//		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ПолучитьТекстЗапроса_ПоМонтажам(); 
//	//Иначе
//	//	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ПолучитьТекстЗапроса_ПоРеализациям(); 
//	//КонецЕсли;
//				
//КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	//#14828
	ОтчетыПотолки.НастроитьОтображениеГруппировкиПодразделение(Настройки);

КонецПроцедуры

Функция ПолучитьТекстЗапроса_ПоРеализациям()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ПродажиОбороты.Регистратор.Основание КАК ЗаказДоговор,
			|	ПродажиОбороты.Регистратор.Основание.Подразделение КАК Подразделение,
	        |	ПродажиОбороты.Организация КАК ОтборОрганизация,
	        |	ПродажиОбороты.Контрагент КАК Клиент,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	        |					ИЛИ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	        |				ТОГДА ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СтоимостьПотолков,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	        |					ИЛИ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	        |					ИЛИ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
	        |				ТОГДА 0
	        |			ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)
	        |		КОНЕЦ) КАК СтоимостьТоваров,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
	        |				ТОГДА ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СтоимостьУслуг,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	        |					ИЛИ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	        |				ТОГДА ЕСТЬNULL(ТоварыНаСкладахОбороты.СуммаРасход, 0)
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СебестоимостьПотолков,
	        |	ЕСТЬNULL(Выработка.СтоимостьОборот, 0) КАК СебестоимостьУслуг,
	        |	ПродажиОбороты.Регистратор.Дата,
	        |	ПродажиОбороты.Регистратор.Основание.НомерДоговора КАК НомерДоговора,
	        |	ВЫРАЗИТЬ(ПродажиОбороты.Регистратор.Основание.Адрес КАК СТРОКА(255)) КАК АдресДоговора,
	        |	ЕСТЬNULL(Материалы.СебестоимостьМатериалов, 0) КАК СебестоимостьМатериалов,
	        |	ЕСТЬNULL(Товары.СебестоимостьТоваров, 0) КАК СебестоимостьТоваров
	        |ИЗ
	        |	РегистрНакопления.Продажи.Обороты(, , Авто, ) КАК ПродажиОбороты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Обороты(, , Авто, ) КАК ТоварыНаСкладахОбороты
	        |		ПО ПродажиОбороты.Регистратор = ТоварыНаСкладахОбороты.Регистратор
	        |			И ПродажиОбороты.Номенклатура = ТоварыНаСкладахОбороты.Номенклатура
	        |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры
	        |			И ПродажиОбороты.СерияНоменклатуры = ТоварыНаСкладахОбороты.СерияНоменклатуры
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			Монтаж.Основание КАК Ссылка,
	        |			СУММА(ВыработкаИсполнителейРозницыОбороты.СтоимостьОборот) КАК СтоимостьОборот
	        |		ИЗ
	        |			Документ.Монтаж КАК Монтаж
	        |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаИсполнителейРозницы.Обороты(, , Регистратор, ) КАК ВыработкаИсполнителейРозницыОбороты
	        |				ПО Монтаж.Ссылка = ВыработкаИсполнителейРозницыОбороты.Регистратор
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			Монтаж.Основание) КАК Выработка
	        |		ПО ПродажиОбороты.Регистратор.Основание = Выработка.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			МонтажМатериалы.Ссылка КАК Ссылка,
	        |			МонтажМатериалы.Ссылка.Основание КАК ОснованиеСсылка,
	        |			МонтажСебестоимостьМатериаловОбороты.СуммаОборот КАК СебестоимостьМатериалов
	        |		ИЗ
	        |			Документ.Монтаж.Материалы КАК МонтажМатериалы
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МонтажСебестоимостьМатериалов.Обороты(, , Регистратор, ) КАК МонтажСебестоимостьМатериаловОбороты
	        |				ПО МонтажМатериалы.Ссылка = МонтажСебестоимостьМатериаловОбороты.Регистратор
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			МонтажМатериалы.Ссылка,
	        |			МонтажСебестоимостьМатериаловОбороты.СуммаОборот,
	        |			МонтажМатериалы.Ссылка.Основание) КАК Материалы
	        |		ПО ПродажиОбороты.Регистратор.Основание = Материалы.ОснованиеСсылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			РеализацияТовары.Ссылка КАК Ссылка,
	        |			-РеализацияСебестоимостьТоваровОбороты.СуммаОборот КАК СебестоимостьТоваров
	        |		ИЗ
	        |			Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТовары
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Обороты(
	        |						,
	        |						,
	        |						Регистратор,
	        |						НЕ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	        |							И НЕ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	        |							И НЕ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)) КАК РеализацияСебестоимостьТоваровОбороты
	        |				ПО РеализацияТовары.Ссылка = РеализацияСебестоимостьТоваровОбороты.Регистратор
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			РеализацияТовары.Ссылка,
	        |			РеализацияСебестоимостьТоваровОбороты.СуммаОборот) КАК Товары
	        |		ПО ПродажиОбороты.Регистратор = Товары.Ссылка
	        |ГДЕ
	        |	ТИПЗНАЧЕНИЯ(ПродажиОбороты.Регистратор.Основание) = ТИП(Документ.ЗаказДоговор)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПродажиОбороты.Регистратор.Основание,
	        |	ПродажиОбороты.Организация,
	        |	ПродажиОбороты.Контрагент,
	        |	Выработка.СтоимостьОборот,
	        |	ПродажиОбороты.Регистратор.Дата,
	        |	ПродажиОбороты.Регистратор.Основание.НомерДоговора,
	        |	ВЫРАЗИТЬ(ПродажиОбороты.Регистратор.Основание.Адрес КАК СТРОКА(255)),
	        |	Материалы.СебестоимостьМатериалов,
	        |	Товары.СебестоимостьТоваров";
	
КонецФункции

Функция ПолучитьТекстЗапроса_ПоМонтажам()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ПродажиОбороты.Регистратор.Основание КАК ЗаказДоговор,
			|	ПродажиОбороты.Регистратор.Основание.Подразделение КАК Подразделение,
	        |	ПродажиОбороты.Организация КАК ОтборОрганизация,
	        |	ПродажиОбороты.Контрагент КАК Клиент,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	        |					ИЛИ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	        |				ТОГДА ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СтоимостьПотолков,
	        |	СУММА(ВЫБОР
	        |			КОГДА НЕ(ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез)
	        |						ИЛИ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)
	        |						ИЛИ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга))
	        |				ТОГДА ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СтоимостьТоваров,
	        |	СУММА(ВЫБОР
	        |			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
	        |				ТОГДА ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК СтоимостьУслуг,
			|	СРЕДНЕЕ(ЕСТЬNULL(Потолки.СуммаРасход, 0)) КАК СебестоимостьПотолков,
	        |	СРЕДНЕЕ(ЕСТЬNULL(Выработка.СтоимостьОборот, 0)) КАК СебестоимостьУслуг,
	        |	ПродажиОбороты.Регистратор.Основание.Дата КАК Дата,
	        |	ПродажиОбороты.Регистратор.Основание.НомерДоговора КАК НомерДоговора,
	        |	ВЫРАЗИТЬ(ПродажиОбороты.Регистратор.Основание.Адрес КАК СТРОКА(255)) КАК АдресДоговора,
	        |	СРЕДНЕЕ(ЕСТЬNULL(Материалы.СебестоимостьМатериалов, 0)) КАК СебестоимостьМатериалов,
	        |	СУММА(ЕСТЬNULL(Товары.СебестоимостьТоваров, 0)) КАК СебестоимостьТоваров
	        |ИЗ
	        |	РегистрНакопления.Продажи.Обороты(, , Авто, ) КАК ПродажиОбороты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Обороты(, , Авто, ) КАК ТоварыНаСкладахОбороты
	        |		ПО ПродажиОбороты.Регистратор = ТоварыНаСкладахОбороты.Регистратор
	        |			И ПродажиОбороты.Номенклатура = ТоварыНаСкладахОбороты.Номенклатура
	        |			И ПродажиОбороты.ХарактеристикаНоменклатуры = ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры
	        |			И ПродажиОбороты.СерияНоменклатуры = ТоварыНаСкладахОбороты.СерияНоменклатуры
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ 
	        |			ВыработкаИсполнителейРозницыОбороты.Регистратор.Основание КАК Ссылка,
	        |			СУММА(ВыработкаИсполнителейРозницыОбороты.СтоимостьОборот) КАК СтоимостьОборот
	        |		ИЗ
	        |			РегистрНакопления.ВыработкаИсполнителейРозницы.Обороты(, , Регистратор, ) КАК ВыработкаИсполнителейРозницыОбороты
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ВыработкаИсполнителейРозницыОбороты.Регистратор.Основание) КАК Выработка
	        |		ПО (Выработка.Ссылка = ПродажиОбороты.Регистратор.Основание)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			МонтажСебестоимостьМатериаловОбороты.ЗаказДоговор КАК Ссылка,
	        |			СУММА(МонтажСебестоимостьМатериаловОбороты.СуммаОборот) КАК СебестоимостьМатериалов
	        |		ИЗ
	        |			РегистрНакопления.МонтажСебестоимостьМатериалов.Обороты(, , Регистратор, ) КАК МонтажСебестоимостьМатериаловОбороты
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			МонтажСебестоимостьМатериаловОбороты.ЗаказДоговор) КАК Материалы
	        |		ПО ПродажиОбороты.Регистратор.Основание = Материалы.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			МонтажСебестоимостьТоваровОбороты.Номенклатура КАК Номенклатура,
	        |			МонтажСебестоимостьТоваровОбороты.Регистратор.Основание КАК Ссылка,
	        |			СУММА(МонтажСебестоимостьТоваровОбороты.СуммаОборот) КАК СебестоимостьТоваров
	        |		ИЗ
	        |			РегистрНакопления.МонтажСебестоимостьТоваров.Обороты(, , Регистратор, ) КАК МонтажСебестоимостьТоваровОбороты
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			МонтажСебестоимостьТоваровОбороты.Номенклатура,
	        |			МонтажСебестоимостьТоваровОбороты.Регистратор.Основание) КАК Товары
	        |		ПО ПродажиОбороты.Регистратор.Основание = Товары.Ссылка
	        |			И ПродажиОбороты.Номенклатура = Товары.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ТоварыНаСкладахОбороты.Регистратор.Основание КАК Ссылка,
	        |			СУММА(ТоварыНаСкладахОбороты.СуммаРасход) КАК СуммаРасход
	        |		ИЗ
	        |			РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез) ИЛИ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок)) КАК ТоварыНаСкладахОбороты
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ТоварыНаСкладахОбороты.Регистратор.Основание) КАК Потолки
			
	        |		ПО ПродажиОбороты.Регистратор.Основание = Потолки.Ссылка
			
	        |ГДЕ
	        |	(ТИПЗНАЧЕНИЯ(ПродажиОбороты.Регистратор) = ТИП(Документ.Монтаж)
	        |			ИЛИ ТИПЗНАЧЕНИЯ(ПродажиОбороты.Регистратор) = ТИП(Документ.Замена))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПродажиОбороты.Регистратор.Основание,
	        |	ПродажиОбороты.Организация,
	        |	ПродажиОбороты.Контрагент,
	        |	ПродажиОбороты.Регистратор.Основание.НомерДоговора,
	        |	ВЫРАЗИТЬ(ПродажиОбороты.Регистратор.Основание.Адрес КАК СТРОКА(255)),
	        |	ПродажиОбороты.Регистратор.Основание.Дата";

	
КонецФункции
